In [15]:
import pandas as pd
import numpy as np
data = {'A':[1,2,3,4,5], 'B':[10,20,30,40,50]}
df=pd.DataFrame(data)
df

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [27]:
s = pd.Series([10, 20, 30, 40,34,45,23,345], dtype=float)
s

0     10.0
1     20.0
2     30.0
3     40.0
4     34.0
5     45.0
6     23.0
7    345.0
dtype: float64

In [28]:
s.values

array([ 10.,  20.,  30.,  40.,  34.,  45.,  23., 345.])

In [29]:
s.index

RangeIndex(start=0, stop=8, step=1)

In [30]:
s.shape

(8,)

In [16]:
data = {
    "Name": ["Alice", "Bob", "Charlie","Nageswara"],
    "Age": [25, 30, 35,np.nan],
    "Salary": [50000, 60000, 70000,np.nan]
}
df = pd.DataFrame(data)
print(df)

        Name   Age   Salary
0      Alice  25.0  50000.0
1        Bob  30.0  60000.0
2    Charlie  35.0  70000.0
3  Nageswara   NaN      NaN

In [5]:
df.head(2)

    Name  Age  Salary
0  Alice   25   50000
1    Bob   30   60000

In [6]:
df.tail(2)

      Name  Age  Salary
1      Bob   30   60000
2  Charlie   35   70000

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     3 non-null      float64
 2   Salary  3 non-null      float64
dtypes: float64(2), object(1)
memory usage: 228.0+ bytes

In [18]:
df.shape

(4, 3)

In [19]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='object')

In [32]:
data=pd.Series([10,20,30,40],index=['i','ii','iii','iv'])
data

i      10
ii     20
iii    30
iv     40
dtype: int64

In [37]:
data=pd.Series([10,20,30,40])